In [1]:
# pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\roshan\appdata\local\programs\python\python39\lib\site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in c:\users\roshan\appdata\local\programs\python\python39\lib\site-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in c:\users\roshan\appdata\local\programs\python\python39\lib\site-packages (from protobuf<=3.20.1,>=3.11.0->mysql-connector-python) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.4; however, version 23.0 is available.
You should consider upgrading via the 'c:\users\roshan\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

### Creating a table with MySQL

In [2]:
from __future__ import print_function

import mysql.connector
from mysql.connector import errorcode
import pandas as pd
import numpy as np

In [3]:
tokyo_olympics = pd.read_csv("Tokyo_Olympics.csv")

In [4]:
tokyo_olympics.head()

,Country,Gold Medal,Silver Medal,Bronze Medal,Total,Rank By Total
0,United States of America,39,41,33,113,1
1,People's Republic of China,38,32,18,88,2
2,Japan,27,14,17,58,5
3,Great Britain,22,21,22,65,4
4,ROC,20,28,23,71,3

In [5]:
DB_NAME = 'olympics'

In [6]:
TABLES = {}

TABLES['Tokyo_Olympic'] = (
    "CREATE TABLE IF NOT EXISTS `Tokyo_Olympic` ("
    "  `Country` varchar(50) ,"
    "  `Gold Medal` varchar(10),"
    "  `Silver Medal` varchar(10) ,"
    "  `Bronze Medal` varchar(10) ,"
    "  `Total` varchar(10),"
    "  `Rank By Total` varchar(10)"
    ") ")

In [7]:
cnx = mysql.connector.connect(user='root', password='G1Ri0nk@#07',
                              host='127.0.0.1')
cursor = cnx.cursor()

In [8]:
def create_database(cursor):
    try:
        cursor.execute(
            "CREATE DATABASE {} DEFAULT CHARACTER SET 'utf8'".format(DB_NAME))
    except mysql.connector.Error as err:
        print("Failed creating database: {}".format(err))
        exit(1)

try:
    cursor.execute("USE {}".format(DB_NAME))
except mysql.connector.Error as err:
    print("Database {} does not exists.".format(DB_NAME))
    if err.errno == errorcode.ER_BAD_DB_ERROR:
        create_database(cursor)
        print("Database {} created successfully.".format(DB_NAME))
        cnx.database = DB_NAME
    else:
        print(err)
        exit(1)

In [9]:
for table_name in TABLES:
    table_description = TABLES[table_name]
    try:
        print("Creating table {}: ".format(table_name), end='')
        cursor.execute(table_description)
    except mysql.connector.Error as err:
        if err.errno == errorcode.ER_TABLE_EXISTS_ERROR:
            print("already exists.")
        else:
            print(err.msg)
    else:
        print("OK")

Creating table Tokyo_Olympic: OK

In [11]:
try:
    for i,row in tokyo_olympics.iterrows():
                sql = "INSERT INTO olympics.Tokyo_Olympic VALUES (%s,%s,%s,%s,%s,%s)"
                cursor.execute(sql, list(row))
                print("Record inserted")
                # the connection is not auto committed by default, so we must commit to save our changes
                cnx.commit()
except mysql.connector.Error as err:
            print("Error while connecting to MySQL", err)

Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted

In [12]:
cursor.close()
cnx.close()